AcGiDrawableEvent.sendAdded(AcGiDrawable*,System.Int64,System.Int64)
Signal the addition of a drawable's graphics to the list of reactors.
pDrawable: Input drawable whose graphics were added.
parentID: Input id of parent drawable.
databasePtr: Input database pointer cast as LONG_PTR.

AcGiDrawableEvent.sendModified(AcGiDrawable*,System.Int64)
Signal the modification of a drawable's graphics to the list of reactors.
pDrawable: Input drawable whose graphics were modified.
parentID: Input id of parent drawable.

AcGiDrawableEvent.sendErased(AcGiDrawable*,System.Int64)
Signal the erasure of a drawable's graphics to the list of reactors.
pDrawable: Input drawable whose graphics were erased.
parentID: Input id of parent drawable.

AcGiDrawableEvent.sendHandOverTo(AcGiDrawable*,AcGiDrawable*)
Signal graphics are being handed over from one drawable to another drawable.
pDrawableFrom: Input drawable from which graphics will be handed over.
pDrawableTo: Input drawable to which graphics will be handed over.

AcGiDrawableEvent.sendErased(AcGiDrawable*)
Signal the erasure of a drawable's graphics to the list of reactors.
pDrawable: Input drawable whose graphics were erased.

AcGiDrawableEvent.sendModified(AcGiDrawable*)
Signal the modification of a drawable's graphics to the list of reactors.
pDrawable: Input drawable whose graphics were modified.

AcGiDrawableEvent.sendEndRegen(AcGiDrawable*,AcGiDrawableReactor.RegenFlags)
Signal the end of a drawable's regen to the list of reactors.
pDrawable: Input drawable that was regenerated.
flags: Input graphics system that performed the regen.

AcGiDrawableEvent.sendBeginRegen(AcGiDrawable*,AcGiDrawableReactor.RegenFlags)
Signal the beginning of a drawable's regen to the list of reactors.
pDrawable: Input drawable about to be regenerated.
flags: Input graphics system that will perform the regen.

AcGiDrawableEvent.removeReactor(AcGiDrawableReactor*)
Remove the reactor from the list of reactors that are notified when drawable events occur.
pReactor: Input reactor to disable notification of drawable events.

AcGiDrawableEvent.addReactor(AcGiDrawableReactor*)
Add the reactor to the list of reactors that are notified when drawable events occur.
pReactor: Input reactor to enable notification of drawable events.

AcGiDrawableEvent.instance
This static method returns the singleton instance of this class.  Use the acgiDrawableEvent macro for convenience.
Returns: The one AcGiDrawableEvent.

AcGiDrawableEvent
AcGiDrawableEvent manages a set of AcGiDrawableReactors and sends
notifications to them when certain events occur.  Access is through
a singleton instance of this class, acgiDrawableEvent. Clients of
AcGiDrawableEvent fall into three categories:
1. Any client interested in making use of AcGiDrawableReactor must
add and remove their reactor through addReactor/removeReactor.
2. AcGiDrawable-derived clients may use this class to notify graphics
systems of modifications and erasures of their graphics.
3. Graphics systems may use this class to notify interested listeners
(e.g. AcGiDrawStream) of regen begin/end events.